//Створюємо масив зі слів !!!
var words = [
    "таня",
    "еріка",
    "інфраструктура",
    "поліклініка",
    "гідрофобність",
    "телефон",
    "ракета",
    "планета",
    "телефон",
    "спроба",
    "слово",
    "програмування",
];
var word = words[Math.floor(Math.random() * words.length)]; // Обираємо виадкове слово з попереднього масиву

var answerArray = []; // Встановлюю пустий масив відповідей
for (var i = 0; i < word.length; i++) { // Цикл, який міняє не відгадані букви в слові на: "_"
    answerArray[i] = "_";
}

var remainingLetters = word.length; // Кількість літер, що залишилось вгадати дорівнює довжині загаданого слова
var trying = word.length +2; // Кількість спроб для вгадування дорівнює довжині загаданого слова + 2
var isHit = false;  // спроба вгадати 

// Ігровий процес
while ((remainingLetters > 0) && (trying > 0)) { // поки залишок літер і кільскість спроб вгадати більше 0
    alert(answerArray.join(" ")); // Показую гравцю його прогресс

var guess = prompt("Вгадайте літеру, або натисність Скасувати щоб зупинити гру."); // Отримую варіати відповідей від гравця
guess = guess.toLocaleLowerCase(); // конвертація великих літер, введених гравцем, у маленькі
if (guess === null) { // якщо гравець нажа "Скасувати"
    break; // Виходимо з гри
} else if (guess.length !==1) { // Якщо ввели більше одної літери
    alert("Будь ласка, введі лише одну літеру!"); // повідомляємо про це 
} else {
    for (var j = 0; j < word.length; j++) { // Якщо ввели вже відгадану літеру
        var letterWasEntered = answerArray[j] === guess;
        if (letterWasEntered) {
            alert("Ви вже вгадали цю букву."); // кажу що вже вгадав цю букву
            break;
        }
        if (word[j] === guess) { // Додаю відгадану літеру в порожній масив з відповідями
            answerArray[j] = guess; // якщо відгадав, то добавляю букву у масив відповідей
            remainingLetters -- ; // кількість відгаданих букв декрементується
            isHit = true; // спроба вдала
        }
    } if (isHit) { // Провіряю кількість спроб щоб вгадати
        trying  --;
        alert("У Вас залишилось " + trying + " спроб");
        if (trying === 0) {
            alert("Ваші спроби закінчились!");
            break;
        }
    }
 }
// Кінець ігрового циклу
}
// Показуємо результат гравцю
alert(answerArray.join(" ")); // показую загадане слово
alert("Загадане слово було: " + word);
